{
    "@context": "https://schema.org/",
    "@type": "JobPosting",
    "title": "Senior Developer - Grow My Clinic",
    "employerOverview": "Co-founded by Ali, an owner of a multi-disciplinary clinic, and Trevor, a developer with an obsessive eye for design, Jane is both beautiful to use and very intentionally focused on the needs and workflows of a hard-working private practice.\r\n\r\nToday, Jane is used by thousands of practitioners worldwide and is proud to have an ever-growing team of passionate developers and customer support reps that champion Jane both locally and internationally.\r\n\r\nBut, it hasn't always been this way. Let’s back up to the beginning to where it all started.",
    "hiringOrganization": {
        "@type": "Organization",
        "name": "Jane",
        "sameAs": "https://jane.app/",
        "logo": "https://cdn.rubyonremote.com/k6lwqiqdjg7waafjhpyqe86khng3"
    },
    "jobLocationType": "TELECOMMUTE",
    "datePosted": "2024-08-05",
    "validThrough": "2024-10-04",
    "directApply": true,
    "experienceRequirements": {
        "@type": "OccupationalExperienceRequirements",
        "monthsOfExperience": 48
    },
    "baseSalary": {
        "@type": "MonetaryAmount",
        "currency": "USD",
        "minValue": "117100",
        "maxValue": "182900"
    },
    "salaryCurrency": "USD",
    "employmentType": "full-time",
    "applicantLocationRequirements": [
        {
            "@type": "Country",
            "name": "CA"
        }
    ],
    "description": "\u003cdiv\u003eWe're looking for Senior Developers to join our Grow My Clinic team. This is a brand new team we are assembling to help our allied health practitioner customers grow their practices while having more time to deliver the services their patients need. We’re working on a multi-year green-field project and are looking for an experienced software professional to play an important role in realizing our vision for Grow My Clinic. This is a significant opportunity to solve a key set of problems for our rapidly customer base and to further Jane’s mission of Helping the Helpers.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eLike with all positions at Jane, this position is a remote position, allowing you to work anywhere you want across Canada. Building a delighted team who can delight our customers is part of Jane’s DNA. In our most recent company-wide health check, 99% of our team agreed that our founders demonstrate people are important to Jane’s success. On top of that, 98% of our team felt Manager cares about them as human beings and that they are supported when needing to arrange time off from work. We’d never claim to be perfect, but we’re working hard to listen to our people and improve each day. \u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eWe really want the people who work at Jane to love being here, so it's important that we start with a bit about what makes our company unique and try to be as transparent as possible. Our\u0026nbsp;\u003ca href=\"https://jane.app/about\"\u003evalues\u003c/a\u003e\u0026nbsp;also provide some insights into Jane and hopefully, you’ll have a better idea if this might be the kind of company you want to be part of. \u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eBefore we were Jane, our Co-Founders were solving problems for their own clinics not realizing that a few years later, this team would grow to support tens of thousands of healthcare practices in more than 60 countries. Our platform is now helping to modernize the world of practice management software. We enable the likes of physiotherapists, mental health counsellors, chiropractors, and other allied health practitioners to run their practices in a digital-first way through features such as online booking, charting, scheduling, telehealth, and billing along with an evolving library of features. You can see more of them\u0026nbsp;\u003ca href=\"https://jane.app/features\"\u003ehere\u003c/a\u003e. Although we’ve grown, still to this day, we’re rooted in solving clinics’ problems and making sure we don’t lose sight of Jane’s vision. \u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eWe have remained profitable for the past seven years, we’re product-led and growing organically (and responsibly) to the point where 85% of our customer growth is either from customer referrals or word of mouth. Growth like this is unique, especially in the world of SaaS, and it doesn’t happen by chance. We have a brilliant team of over 400 Janers who are doing an amazing job of listening to our customers, building what they need, and providing industry-leading support. We pride ourselves on flexibility \u0026amp; autonomy, some of our team block out their calendars to pick up their children from school (and this is normal at Jane), and we even have a #kids channel in Slack.  \u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eWe’re not a clock-in clock-out system-type environment. With that being said, we’re not going to paint the picture of a perfect environment either. We’re a company that’s scaling quickly, we have many moving parts, many of us are doing this for the first time and sometimes, we don’t have processes in place or clear views which can require a lot of resourcefulness and a passion for problem-solving. \u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eWith all that to say, if you’re looking for an environment where you can grow, stretch yourself, and work with some incredibly talented people on problems that are positively impacting people's lives, Jane could be the place for you.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003e\u003cb\u003eCompensation Expectations for the Role\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eJane’s committed to paying our team members fairly, clearly, and above all, paying for growth. This role has a minimum annual salary of $117,100 and a maximum annual salary of $182,900. As you may have noticed, this salary range is quite large, and this is intentional to account for the growth someone will experience in the role throughout their time at Jane (i.e., from building the skills, to accomplished, to highly proficient, all the way to achieving excellence in the role).\u003cb\u003e\u0026nbsp;When hiring talented folks to join the Jane team, we’ve found that new team members are best set up for success when hired with the expectation of being fully accomplished in the role, which for this role would reflect a salary between $139,000 to $146,300.\u003c/b\u003e\u0026nbsp;It's also possible to join Jane at a salary above or below this, which would mean a salary below $139,000 which typically reflects someone who has all the potential to be fully accomplished in the role but doesn't yet possess all the skills required, while a salary above $146,300 is typically for individuals who are currently in this role at Jane and had the opportunity to make a significant positive impact on our customers, product and company with deep Jane knowledge.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eAt Jane, we pay for growth, which means that you’ll continue to have conversations about your career development with your manager and see your compensation grow over time as you build an amazing career with us.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eMore information on Jane's benefits package can be found\u0026nbsp;\u003ca href=\"https://jane.app/documents/hiring/jane_benefits_overview.pdf\"\u003ehere\u003c/a\u003e.\u003c/div\u003e\n\n\u003cstrong\u003eThe impact you could have… \u003c/strong\u003e\u003cul\u003e\u003cli\u003eYour role will have significant responsibilities for contributing to the technical vision for the Grow My Clinic product, helping us move quickly, fail fast, and set the stage for significant scale in the future.\u003c/li\u003e\u003cli\u003eYou will have the opportunity to participate in key decisions on infrastructure, data model, services, and interface, and be a force multiplier on what we can achieve going forward.\u003c/li\u003e\u003cli\u003eYou will have the opportunity to build on your leadership and mentoring skills, working with your fellow developers to grow their skills and confidence.\u003c/li\u003e\u003cli\u003eYou will use your experience in building quality software quickly to help us show one another what is possible when we combine effort and ability.\u003c/li\u003e\u003cli\u003eYou will help us make a material impact on our customers’ ability to deliver their services to more patients, and subsequently help those patients improve the quality of their lives.\u003c/li\u003e\u003cli\u003eBy helping us be true to our value for building delightful products, you will help us create advocates in the market and fuel the growth we can achieve.\u003c/li\u003e\u003c/ul\u003e\n\u003cstrong\u003eThe experience we feel we need:\u003c/strong\u003e\u003cul\u003e\u003cli\u003eSomeone who can independently take charge of a specific component within our product, making swift and decisive progress. While collaboration remains a key part of our culture, we need someone who is confident in their ability to own and deliver a crucial piece of our application.\u003c/li\u003e\u003cli\u003eLead the development and maintenance of critical components within the Grow My Clinic product, covering both backend and frontend aspects.\u003c/li\u003e\u003cli\u003eUtilize your expertise in technologies such as Ruby on Rails, React, PostgreSQL, and AWS to build robust, scalable solutions.\u003c/li\u003e\u003cli\u003eAct as a technical mentor, guiding less experienced developers and fostering a collaborative team environment.\u003c/li\u003e\u003cli\u003eExtensive full-stack development experience, with a strong grasp of infrastructure, backend, and frontend technologies.\u003c/li\u003e\u003cli\u003eCompetency in containerization and orchestration tools, with exposure to platforms like Kubernetes or Amazon Elastic Container Service.\u003c/li\u003e\u003cli\u003eSignificant experience in at least one of the following areas: designing and integrating APIs, developing modern, responsive web application interfaces, handling sensitive data (PHI and PII) with a focus on security and compliance, implementing DevOps practices, including CI/CD, and building reliable, observable systems, leading 0 to 1 software product development initiatives. \u003c/li\u003e\u003cli\u003eProactive and capable Senior Developer who can bring their wealth of experience to our team, helping to drive the Grow My Clinic product forward efficiently and effectively.\u003c/li\u003e\u003c/ul\u003e\n\u003cdiv\u003eAt Jane, we’re committed to fostering an environment that allows you to come to work as your truest self. We believe it’s important to actively recognize, embrace, and celebrate our differences in order to make Jane an inclusive, equitable, and diverse workplace.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eWe want to build a team of people who make conversations rich with perspective and experience. We are committed to listening to every voice in order to learn and grow because doing this will allow us to meet the needs of the diverse community of helpers that Jane serves.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eWe do not tolerate discrimination, prejudice, or oppressive isms of any kind. Employment is decided on the basis of qualifications, merit, experience, and the needs of the Jane community. We encourage anyone who requires accommodation or adjustments throughout the interview process to let us know, and we will do our best to support you.\u003c/div\u003e"
}